app/controllers/searchcase_controller.rb

SELECT  `NARA_CaseFiles`.* FROM `NARA_CaseFiles` WHERE (LASTNAME like '%%' or FIRSTNAME like '%%' or DESTINATION like '%%' or BIRTHPLACE like '%%' or PORT like '%%' or date like '%%' or Case_ID like '%%' or ship like '%%')  ORDER BY `NARA_CaseFiles`.`LASTNAME` ASC, `NARA_CaseFiles`.`FIRSTNAME` ASC LIMIT 100 OFFSET 0
---
  def display

     @result = params[:q]
     @result.gsub! "'","*"
     @result.gsub! "+",""
     @result.gsub! "-",""
     @result = word_less_than_four(@result)
 #    @result = @result.to_s
     @queryCount = @result.split.count



                #@lastname = SearchCasefile.where("state = ? and city= ?" ,params[:state], params[:city])
#               @return = SearchCasefile.where("LASTNAME like ? or FIRSTNAME like ? or DESTINATION like ? or BIRTHPLACE like ? or PORT like ? or date like ? or Case_ID like ? or ship like ?" ,@result,@result,@result,@result,@result,@result,@result,@result).select(:LASTNAME,:FIRSTNAME,:MIDDLENAME,:AGE,:GENDER,:date,:Case_ID,:PORT,:ship,:destination).order(:LASTNAME,:FIRSTNAME)

                #@return = SearchCasefile.where("LASTNAME like ? or FIRSTNAME like ? or DESTINATION like ? or BIRTHPLACE like ? or PORT like ? or date like ? or Case_ID like ? or ship like ?" ,@result,@result,@result,@result,@result,@result,@result,@result).order(:LASTNAME,:FIRSTNAME)

                if @result.empty?
                        @return = SearchCasefile.all.order(:LASTNAME,:FIRSTNAME)

SELECT `NARA_CaseFiles`.`LASTNAME`, `NARA_CaseFiles`.`FIRSTNAME`, `NARA_CaseFiles`.`MIDDLENAME`, `NARA_CaseFiles`.`BOXNUMBER`, `NARA_CaseFiles`.`SERIES`, `NARA_CaseFiles`.`CASENUMBER`, `NARA_CaseFiles`.`SHIP`, `NARA_CaseFiles`.`DATE`, `NARA_CaseFiles`.`DESTINATION`, `NARA_CaseFiles`.`BIRTHPLACE`, `NARA_CaseFiles`.`BIRTHPLACE_CITY`, `NARA_CaseFiles`.`BIRTHPLACE_STATE`, `NARA_CaseFiles`.`DOB`, `NARA_CaseFiles`.`AGE`, `NARA_CaseFiles`.`GENDER`, `NARA_CaseFiles`.`AFILENUM`, `NARA_CaseFiles`.`CLASS`, `NARA_CaseFiles`.`DISPOSITION_OF_CASE`, `NARA_CaseFiles`.`ST_BORN`, `NARA_CaseFiles`.`HOUSE_NUM`, `NARA_CaseFiles`.`OTHERNAMEL`, `NARA_CaseFiles`.`OTHERNAMEF`, `NARA_CaseFiles`.`OTHERNAMEM`, `NARA_CaseFiles`.`CERTIFICATE_OF_RESIDENCE`, `NARA_CaseFiles`.`CERTIFICATE_OF_IDENTITY`, `NARA_CaseFiles`.`RED_EAGLE_CERTIFICATE`, `NARA_CaseFiles`.`COURT_RECORD`, `NARA_CaseFiles`.`REMARKS`, `NARA_CaseFiles`.`PORT`, `NARA_CaseFiles`.`SOURCE`, `NARA_CaseFiles`.`DATE_ENTERED` FROM `NARA_CaseFiles` WHERE (Case_ID = '191572')
---
        def fullDisplay
                @result = params[:data]
                @return = SearchCasefile.where("Case_ID = ?",@result).select(:LASTNAME,:FIRSTNAME,:MIDDLENAME,:BOXNUMBER,:SERIES,:CASENUMBER,:SHIP,:DATE,:DESTINATION,:BIRTHPLACE,:BIRTHPLACE_CITY,:BIRTHPLACE_STATE,:DOB,:AGE,:GENDER,:AFILENUM,:CLASS,:DISPOSITION_OF_CASE,:ST_BORN,:HOUSE_NUM,:OTHERNAMEL,:OTHERNAMEF,:OTHERNAMEM,:CERTIFICATE_OF_RESIDENCE,:CERTIFICATE_OF_IDENTITY,:RED_EAGLE_CERTIFICATE,:COURT_RECORD,:REMARKS,:PORT,:SOURCE,:COMPANY,:DATE_ENTERED)